app/controllers/posts_controller.rb

  def new
    binding.pry
    # if it contains the author_id in params with a value and if the author does not exits.
    if params[:author_id] && !Author.exists?(params[:author_id])
---
SELECT  1 AS one FROM "authors" LIMIT 1
SELECT "authors".* FROM "authors"

  def edit
    # checking to see if the nested route http://localhost:3000/authors/4/posts/18/edit was use vs posts/18/edit
    if params[:author_id]
      # looks to see if the author provided exist in the database
      author = Author.find_by(id: params[:author_id])
      if author.nil?
        redirect_to authors_path, alert: "Author not found."
      else
        # if the @post is not nil than the default will send this info to the update.
        @post = author.posts.find_by(id: params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 123456]]
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT 1  [["author_id", 1], ["id", 1]]